GetFamilySymbolIds Method
 Gets the ids of the FamilySymbols owned by this Family.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2015
 Syntax
  C#
public ISet<ElementId> GetFamilySymbolIds()
  Visual Basic
Public Function GetFamilySymbolIds As ISet(Of ElementId)
  Visual C++
public:
ISet<ElementId^>^ GetFamilySymbolIds()
 Return Value
 The ids of the FamilySymbols.
 See Also
  Family Class
  Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →